# ==================================================
# Core CLI and DEV tools
# ==================================================

brew "xcodes"
brew "git"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "openssl@3"
brew "tree"
brew "volta"
brew "pkg-config"
brew "cmake"

# ==================================================
# Editors / development
# ==================================================

brew "neovim"

cask "visual-studio-code"
cask "cursor"
cask "claude-code"

# ==================================================
# Mobile / Android
# ==================================================

cask "android-platform-tools"
cask "android-studio"

# ==================================================
# Containers
# ==================================================

cask "docker-desktop"

# ==================================================
# Browsers
# ==================================================

cask "brave-browser"
cask "google-chrome"
cask "vivaldi"

# ==================================================
# Terminal
# ==================================================

cask "iterm2"

# ==================================================
# Design
# ==================================================

cask "figma"

# ==================================================
# System / Input
# ==================================================

cask "hammerspoon"
cask "karabiner-elements"

# ==================================================
# Auth / Enterprise
# ==================================================

cask "lastpass"
cask "okta"

# ==================================================
# API / Dev tools
# ==================================================

cask "postman"
brew "maven"

# ==================================================
# Productivity
# ==================================================

cask "raycast"
cask "slack"
brew "tmux"

# ==================================================
# Zsh plugins
# ==================================================

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --------------------------------------------------
# Java (Eclipse Temurin - OpenJDK distributions)
# --------------------------------------------------

cask "temurin@17"
cask "temurin@21"
